---
kind: property
id: P:Autodesk.Revit.DB.Ellipse.XDirection
source: html/fcb341bd-8b22-e940-d94e-56430e19fdfc.htm
---
# Autodesk.Revit.DB.Ellipse.XDirection Property

The X direction.

## Syntax (C#)
```csharp
public XYZ XDirection { get; }
```